EDT/УТ/src/Catalogs/КартыКонструктораКарт/КартыКонструктораКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КартыКонструктораКарт</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПолигональнаяМаршрутизация</name>
      <description>Полигональная маршрутизация</description>
    </items>
    <items>
      <name>РасчетЗПДоставки</name>
      <description>Расчет ЗП доставки</description>
    </items>
    <items>
      <name>РасчетЗПЗаборы</name>
      <description>Расчет ЗП заборы</description>
    </items>
    <items>
      <name>ТарификацияПартнеров</name>
      <description>Тарификация партнеров</description>
    </items>
  </predefined>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_Админка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаТарификацииПартнеров_IDsql</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТарификацииПриНепривязанномАдресе</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/АктуальныеСхемыЗонКартТарификацииПартнеров/АктуальныеСхемыЗонКартТарификацииПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальныеСхемыЗонКартТарификацииПартнеров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СхемаЗонТарификацииПартнеров</name>
    <type>
      <types>CatalogRef.СхемыЗонТарификацииПартнеров</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>КартаКонструктораКарт</name>
    <type>
      <types>CatalogRef.КартыКонструктораКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыЗапросовWEBСервис/ВидыЗапросовWEBСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗапросовWEBСервис</name>
  <enumValues>
    <name>GetMapVersionsResult</name>
  </enumValues>
  <enumValues>
    <name>GetMapResult</name>
  </enumValues>
  <enumValues>
    <name>GetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetPolygonsForOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>CreateMapResult</name>
  </enumValues>
  <enumValues>
    <name>SetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetDistanceResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderCarsResult</name>
  </enumValues>
  <enumValues>
    <name>SetAcceptedPlacesResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderLocationFlagResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersStatusResult</name>
  </enumValues>
  <enumValues>
    <name>UpdateReasonsDirectoryResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersFinalStatusResult</name>
  </enumValues>
  <enumValues>
    <name>GetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetRefusedOrderItemsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersDeliveryDateResult</name>
  </enumValues>
  <enumValues>
    <name>SetServiceDcResult</name>
  </enumValues>
  <enumValues>
    <name>SetExcludedBarcodesResult</name>
  </enumValues>
  <enumValues>
    <name>DeleteFileResult</name>
  </enumValues>
  <enumValues>
    <name>SaveFileResult</name>
  </enumValues>
  <enumValues>
    <name>GetModifiedOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>SetPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>FinalizationPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>GetDeliveryCostCalculationTariffsResult</name>
  </enumValues>
  <enumValues>
    <name>getCustomerLinkResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersStateResult</name>
  </enumValues>
  <enumValues>
    <name>uploadReceiptsResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersZoneResult</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/СхемыЗонТарификацииПартнеров/СхемыЗонТарификацииПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыЗонТарификацииПартнеров</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыКонструктораКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>id_Админка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ЗоныТарификацииПартнеров/ЗоныТарификацииПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗоныТарификацииПартнеров</name>
  <owners>Catalog.СхемыЗонТарификацииПартнеров</owners>
  <attributes>
    <name>id_Админка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТочкиПолигона</name>
    <attributes>
      <name>id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/КартыКонструктораКарт/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Родитель = Справочники.КартыКонструктораКарт.ТарификацияПартнеров Тогда
	Иначе
		Элементы.ФормаСоздатьСхемуТарификации.Доступность = Ложь;
		//Асеев 10.10.2024 (Задача № 5335)>>>
		Элементы.КартаТарификацииПартнеров_IDsql.Доступность = Ложь;
		Элементы.ЗонаТарификацииПриНепривязанномАдресе.Доступность = Ложь;
		//Асеев 10.10.2024 (Задача № 5335)<<<
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьСхемуТарификацииНаСервере()
	
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.CreateMapResult;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(Объект.Регион.Код, "ЧГ="));
	ПараметрыЗапроса.Вставить("constructorId", Объект.ИдентификаторКарты);
	                            
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Сообщить("CreateMapResult - неуспешно!");
		Возврат Неопределено;
	КонецЕсли;		
	
	Данные = ПолученныеДанные.Данные;
	
	Таб = Новый ТаблицаЗначений();
	Таб.колонки.Добавить("CreateDate", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Таб.колонки.Добавить("versionID", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	Таб.колонки.Добавить("regionID", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	Если ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapVersionsResult Тогда
		Схемы = Данные.GetMapVersionsResult.Maps;
		Для Сч = 0 По Схемы.Количество() - 1 Цикл
			Нов = Таб.Добавить();
			ЗаполнитьЗначенияСвойств(Нов, Схемы[Сч]);
		КонецЦикла;	
	ИначеЕсли ВидМетода = Перечисления.ВидыЗапросовWEBСервис.CreateMapResult Тогда
		Схема = Данные.CreateMapResult.Map;
		Нов = Таб.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Схема);
		Нов.CreateDate = ТекущаяДата();
	КонецеСли;
	
	СхемыЗонТарификацииПартнеров = Справочники.СхемыЗонТарификацииПартнеров.НайтиПоРеквизиту("id_Админка", Нов.versionID);
	Если СхемыЗонТарификацииПартнеров.Пустая() Тогда
		СхемыЗонТарификацииПартнеров = Справочники.СхемыЗонТарификацииПартнеров.СоздатьЭлемент();
		СхемыЗонТарификацииПартнеров.ДатаСоздания = Нов.CreateDate;
	Иначе
		СхемыЗонТарификацииПартнеров = СхемыЗонТарификацииПартнеров.ПолучитьОбъект();
	КонецЕсли;
	СхемыЗонТарификацииПартнеров.id_Админка = Нов.versionID;
	СхемыЗонТарификацииПартнеров.Карта = Объект.Ссылка;
	СхемыЗонТарификацииПартнеров.Регион = Объект.Регион;
	СхемыЗонТарификацииПартнеров.Наименование = Объект.Наименование;
	СхемыЗонТарификацииПартнеров.Записать();
	
	МассивИдентификаторовСхем = Новый Массив;
	
	Для каждого ТекСтрока из Таб цикл
		МассивИдентификаторовСхем.Добавить(ТекСтрока.versionID);
	КонецЦикла;
	
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapResult;
	Схема = СхемыЗонТарификацииПартнеров.Ссылка;
	
	Для Каждого ИдентификаторСхемы из МассивИдентификаторовСхем Цикл
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("ИдентификаторСхемы", ИдентификаторСхемы);
		ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
		
		Если Не ПолученныеДанные.Успешно Тогда
			Сообщить("GetMapResult - неуспешно!");
			Возврат Неопределено;
		КонецЕсли;
		
		Полигоны = ПолученныеДанные.Данные.GetMapResult.Map.Polygons;
		
		Для Сч = 0 По Полигоны.Количество() - 1 Цикл
			Полигон = Полигоны[Сч];
			ПолигонСсылка = Справочники.ЗоныТарификацииПартнеров.НайтиПоРеквизиту("id_Админка", Полигон.id,, Схема);
			Если ПолигонСсылка.Пустая() Тогда
				ПолигонОбъект = Справочники.ЗоныТарификацииПартнеров.СоздатьЭлемент();
				ПолигонОбъект.Владелец = Схема;
			Иначе	
				ПолигонОбъект = ПолигонСсылка.ПолучитьОбъект();
				ПолигонОбъект.ТочкиПолигона.Очистить();
			КонецеСли;	
			
			ПолигонОбъект.id_Админка = Полигон.id;
			ПолигонОбъект.Наименование = СокрЛП(СтрЗаменить(Полигон.Name, Символы.ПС, ""));
			
			ТочкиПолигона = Полигон.PolygonPoints;
			Для СчТочки = 0 По ТочкиПолигона.Количество() - 1 Цикл
				Нов = ПолигонОбъект.ТочкиПолигона.Добавить();
				Нов.id = ТочкиПолигона[СчТочки].id;
				Нов.Широта = ТочкиПолигона[СчТочки].Latitude;
				Нов.Долгота = ТочкиПолигона[СчТочки].Longitude;
			КонецЦикла;	
			ПолигонОбъект.Записать();
		КонецЦикла;	

	КонецЦикла;
	
	Возврат Схема;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСхемуТарификации(Команда)
	
	Если Не (ЗначениеЗаполнено(Объект.Регион) И ЗначениеЗаполнено(Объект.ИдентификаторКарты)) Тогда
		ПоказатьПредупреждение(, "Регион и Идентификатор карты должны быть заполнены!");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ПоказатьПредупреждение(, "Карта не записана!");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьСхемуТарификацииВопрос", ЭтотОбъект), "Создать схему тарификации?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСхемуТарификацииВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Схема = СоздатьСхемуТарификацииНаСервере();
	Если Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьСхемуТарификацииВопрос", ЭтотОбъект, Новый Структура("Схема", Схема)), "Установить новую схему карт активной?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСхемуТарификацииВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСхемуТарификацииНаСервере(ДополнительныеПараметры.Схема);
	
	ПоказатьПредупреждение(, "Выставите номера зон в справочнике зон!");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСхемуТарификацииНаСервере(Схема)
	
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.SetActiveMapVersionResult;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИдентификаторСхемы", Схема.id_Админка);
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(Объект.Регион.Код, "ЧГ="));
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Сообщить("SetActiveMapVersionResult - неуспешно!");
		Возврат;
	КонецЕсли;		
	
	ЗаписьРегистра = РегистрыСведений.АктуальныеСхемыЗонКартТарификацииПартнеров.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период = ТекущаяДата();
	ЗаписьРегистра.КартаКонструктораКарт = Объект.Ссылка;
	ЗаписьРегистра.СхемаЗонТарификацииПартнеров = Схема;
	ЗаписьРегистра.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистра.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Асеев 10.10.2024 (Задача № 5335)>>>
	Если Объект.Родитель = Справочники.КартыКонструктораКарт.ТарификацияПартнеров Тогда
		Если ПустаяСтрока(Объект.КартаТарификацииПартнеров_IDsql) Тогда
			Отказ = Истина;
			Сообщить("Идентификатор тарификации (админка) не указан!");
			Возврат;
		КонецЕсли;
		Если Объект.ЗонаТарификацииПриНепривязанномАдресе.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Зона тарификации при непривязанном адресе не заполнена!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Асеев 10.10.2024 (Задача № 5335)<<<

КонецПроцедуры
